artillery/performance-test.yml
config:
  target: 'https://fpvlog-backend.onrender.com'
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Warm up"
    - duration: 120
      arrivalRate: 2
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 5
      name: "Sustained load"
  variables:
    testPassword: "TestPassword123!"
  processor: "./test-functions.cjs"

scenarios:
  - name: "Complete User Journey"
    weight: 70
    flow:
      # 0. Generar datos únicos para esta sesión
      - function: "generateTestData"
      
      # 1. Health Check
      - get:
          url: "/health"
          capture:
            - json: "$.status"
              as: "healthStatus"
      
      # 2. User Registration
      - post:
          url: "/auth/register"
          json:
            email: "{{ uniqueEmail }}"
            password: "{{ testPassword }}"
            username: "{{ uniqueUsername }}"
            name: "Test"
            lastName: "User"
          capture:
            - json: "$.token"
              as: "authToken"
      
      # 3. User Login (alternative flow)
      - post:
          url: "/auth/login"
          json:
            email: "{{ uniqueEmail }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "loginToken"
      
      # 4. Get User Profile
      - get:
          url: "/users/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"
          capture:
            - json: "$.user._id"
              as: "userId"
      
      # 5. List Spots (Public endpoint)
      - get:
          url: "/spots?page=1&limit=10"
          capture:
            - json: "$.spots[0]._id"
              as: "spotId"
      
      # 6. Get Spot Details
      - get:
          url: "/spots/{{ spotId }}"
          ifTrue: "spotId"
      
      # 7. Create a New Spot
      - post:
          url: "/spots"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            name: "Test Spot {{ $randomString() }}"
            description: "Performance test spot"
            location:
              type: "Point"
              coordinates: [-3.7038, 40.4168]
            visibility: "PUBLIC"
            legalStatus: "WITHOUT_ANALIZED"
          capture:
            - json: "$._id"
              as: "newSpotId"
      
      # 8. Get Feeds
      - get:
          url: "/feeds?page=1&limit=10"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Read-Only Operations"
    weight: 30
    flow:
      # Generar datos únicos si es necesario
      - function: "generateTestData"
      
      # Health check
      - get:
          url: "/health"
      
      # Browse spots without auth
      - get:
          url: "/spots?page={{ $randomInt(1, 5) }}&limit=20"
      
      # Get drone types
      - get:
          url: "/drone-types?page=1&limit=10"
      
      # Get drone brands
      - get:
          url: "/drone-brands?page=1&limit=10"
      
      # Get components
      - get:
          url: "/components?page=1&limit=10"